QGDsolver/tutorials/reactingQGDFoam/3D/JetH2/constant/reactions
species
(
    H2
    air
);

reactions
{
}
