QGDsolver/tutorials/reactingQGDFoam/3D/JetH2/constant/thermophysicalProperties
/*--------foamChemistryFile "$FOAM_CASE/constant/reactions";------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.1;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiQGDThermo;
    mixture         reactingMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;//sensibleInternalEnergy;
}

dpdt yes;

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/reactions";
foamChemistryThermoFile "$FOAM_CASE/constant/thermo.compressibleGas";

inertSpecie air;

liquids
{
}

solids
{}

QGD
{
    implicitDiffusion true;
//    QGDCoeffs constScPrModel1;
    QGDCoeffs varScModel7;
    varScModel7Dict
//    constScPrModel1Dict
    {
        cSc1  1;
        ScQGD 0.0;
        PrQGD 0.72;
    }
}

// ************************************************************************* //
